---
title: AnalyticalLinkType
classe: Autodesk.Revit.DB.Structure.AnalyticalLinkType
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# AnalyticalLinkType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AnalyticalFixityState RotationX { get; set; }` | `analyticalLinkType.RotationX` | AnalyticalFixityState |
| `AnalyticalFixityState RotationY { get; set; }` | `analyticalLinkType.RotationY` | AnalyticalFixityState |
| `AnalyticalFixityState RotationZ { get; set; }` | `analyticalLinkType.RotationZ` | AnalyticalFixityState |
| `AnalyticalFixityState TranslationX { get; set; }` | `analyticalLinkType.TranslationX` | AnalyticalFixityState |
| `AnalyticalFixityState TranslationY { get; set; }` | `analyticalLinkType.TranslationY` | AnalyticalFixityState |
| `AnalyticalFixityState TranslationZ { get; set; }` | `analyticalLinkType.TranslationZ` | AnalyticalFixityState |
| `Boolean IsValidAnalyticalFixityState(AnalyticalFixityState)` | `AnalyticalLinkType.IsValidAnalyticalFixityState(fixityState)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```